constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh newDynamicBodyFvMesh;
// dynamicFvMesh      staticFvMesh;

solver totalVelocityLaplacian;
diffusivity quadratic inverseDistance 1( interface );
nNonOrthogonalCorrectors 2;

newDynamicBodyFvMeshCoeffs
{
    bodyPatchName interface;
  
    translationDirection (0 1 0);
    translationAmplitude 0.01;
    translationFrequency 0.1;

    initialRotationOrigin (0 0 0);
    rotationAxis (0 0 1);
    rotationAmplitude 0;
    rotationFrequency 0;
}


// ************************************************************************* //
