constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)		// 0
    (280 0 0)		// 1
    (280 280 0)		// 2
    (0 280 0)		// 3
    (0 0 100)		// 4
    (280 0 100)		// 5
    (280 280 100)	// 6
    (0 280 100)		// 7

    (320 0 0)		// 8
    (320 280 0)		// 9
    (320 0 100)		// 10
    (320 280 100)	// 11

    (600 0 0)		// 12
    (600 280 0)		// 13
    (600 0 100)		// 14
    (600 280 100)	// 15

    (600 320 0)		// 16
    (320 320 0)		// 17
    (600 320 100)	// 18
    (320 320 100)	// 19

    (600 600 0)		// 20
    (320 600 0)		// 21
    (600 600 100)	// 22
    (320 600 100)	// 23

    (280 600 0)		// 24
    (280 320 0)		// 25
    (280 600 100)	// 26
    (280 320 100)	// 27

    (0 600 0)		// 28
    (0 320 0)		// 29
    (0 600 100)		// 30
    (0 320 100)		// 31
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (28 28 10) simpleGrading (1 1 1)

    hex (1 8 9 2 5 10 11 6) (4 28 10) simpleGrading (1 1 1)

    hex (8 12 13 9 10 14 15 11) (28 28 10) simpleGrading (1 1 1)

    hex (9 13 16 17 11 15 18 19) (28 4 10) simpleGrading (1 1 1)

    hex (17 16 20 21 19 18 22 23) (28 28 10) simpleGrading (1 1 1)

    hex (25 17 21 24 27 19 23 26) (4 28 10) simpleGrading (1 1 1)

    hex (29 25 24 28 31 27 26 30) (28 28 10) simpleGrading (1 1 1)

    hex (3 2 25 29 7 6 27 31) (28 4 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (7 3 0 4)		// B0
            (30 28 29 31)	// B6
            (31 29 3 7)		// B7
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (13 15 14 12)	// B2
            (16 18 15 13)	// B3
            (20 22 18 16)	// B4
        );
    }
    interface
    {
        type patch;
        faces
        (
            (2 6 11 9)		// B1
            (19 17 9 11)	// B3
            (27 25 17 19)	// B5
            (25 27 6 2)		// B7
        );
    }
    wall
    {
        type wall;
        faces
        (
            (3 2 1 0)		// B0
            (4 5 6 7)
            (5 4 0 1)
            //(3 7 6 2)

            (1 2 9 8)		// B1
            (5 10 11 6)
            (10 5 1 8)

            (8 9 13 12)		// B2
            (10 14 15 11)
            (14 10 8 12)

            (9 17 16 13)	// B3
            (11 15 18 19)

            (17 21 20 16)	// B4
            (21 23 22 20)
            (19 18 22 23)

            (25 24 21 17)	// B5
            (27 19 23 26)
            (24 26 23 21)

            (29 28 24 25)	// B6
            (28 30 26 24)
            (27 26 30 31)

            (3 29 25 2)		// B7
            (6 27 31 7)

        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
