constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          600;
        startFace       102656;
    }
    outlet
    {
        type            patch;
        nFaces          600;
        startFace       103256;
    }
    interface
    {
        type            patch;
        nFaces          160;
        startFace       103856;
    }
    wall
    {
        type            wall;
        nFaces          8368;
        startFace       104016;
    }
)


// ************************************************************************* //
