system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          1e-3;
        minIter         1;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }

    "U|UFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }

    cellMotionU
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }
}

PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
}

PIMPLE 
{
    nOuterCorrectors 2; // Iterative PISO
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        U    0.7;
        UFinal 0.7;
    }
    fields
    {
        p    0.3;
    }
}

// ************************************************************************* //
